MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_11/System.cpp
        outLatDeg = (float)rad2deg(lat2);
        outLonDeg = (float)rad2deg(lon2);

        while (outLonDeg > 180.0f) outLonDeg -= 360.0f;
        while (outLonDeg < -180.0f) outLonDeg += 360.0f;
    }

//------------------------------------------------------------------------------
// Назначение функции: Возвращает текущее состояние, параметр или признак модуля.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
    static time_t currentSystemSeconds()
    {
        const time_t t = now();
        return (t > 0) ? t : (time_t)(millis() / 1000UL);
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
    static bool ownshipHasAnyCoordinates()
    {
        return (ThisAircraft.latitude != 0.0f || ThisAircraft.longitude != 0.0f ||
                ThisAircraft.old_latitude != 0.0f || ThisAircraft.old_longitude != 0.0f);
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
    static void resolveTestBaseCoordinates(float& baseLat, float& baseLon)
    {
        if (fabsf(baseLat) > 0.00001f || fabsf(baseLon) > 0.00001f)
        {
            return;
        }

        baseLat = kDefaultTestBaseLat;
        baseLon = kDefaultTestBaseLon;
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
    static void refreshOwnshipTimestamp()
    {
        ThisAircraft.timestamp = currentSystemSeconds();
    }

//------------------------------------------------------------------------------
// Назначение функции: Обновляет состояние, применяет настройки или записывает новые значения.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
    static void applyOwnshipIdentity(uint8_t mode)
    {
        if (FlyRfMode_usesLocalCoordinates(mode))
        {
            ThisAircraft.squawk = 1110;
            fillCallsign(ThisAircraft.callsign, sizeof(ThisAircraft.callsign), "TEST001");
            ThisAircraft.aircraft_type = AIRCRAFT_TYPE_JET;
        }
        else
        {
            ThisAircraft.squawk = 1111;
            fillCallsign(ThisAircraft.callsign, sizeof(ThisAircraft.callsign), "FlyRF");
            ThisAircraft.aircraft_type = settings ? settings->aircraft_type : AIRCRAFT_TYPE_UNKNOWN;
        }
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
    static bool advanceMotionStep(uint32_t nowMs, uint32_t& lastStepMs, int16_t& offsetSteps, int8_t& direction)
    {
        bool changed = false;  // Параметр геометрии, координаты, размера или угла.
        while ((uint32_t)(nowMs - lastStepMs) >= kMotionStepPeriodMs)
        {
            lastStepMs += kMotionStepPeriodMs;
            offsetSteps = (int16_t)(offsetSteps + direction);
            if (offsetSteps >= kTestTrackLimitSteps)
            {
                offsetSteps = kTestTrackLimitSteps;
                direction = -1;
            }
            else if (offsetSteps <= -kTestTrackLimitSteps)
            {
                offsetSteps = -kTestTrackLimitSteps;
                direction = 1;
            }
            changed = true;
        }
        return changed;
    }

//------------------------------------------------------------------------------
// Назначение функции: Вычисляет производные параметры и подготавливает результат для других модулей.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
    static void computeTrackPosition(float baseLat, float baseLon, float forwardCourseDeg,
                                     int16_t offsetSteps, int8_t direction,
                                     float& outLat, float& outLon, float& outCourse, float& outSpeed)
    {
        const float reverseCourseDeg = normalizeCourse360(forwardCourseDeg + 180.0f);
        const float legBearing = (offsetSteps >= 0) ? forwardCourseDeg : reverseCourseDeg;
        const double distanceMeters = fabs((double)offsetSteps) * (double)kTestTrackStepMeters;
        projectCoordinate((double)baseLat, (double)baseLon, legBearing, distanceMeters, outLat, outLon);
        outCourse = (direction >= 0) ? forwardCourseDeg : reverseCourseDeg;
        outSpeed = kTestTrackSpeedKnots;
    }

//------------------------------------------------------------------------------
// Назначение функции: Вычисляет производные параметры и подготавливает результат для других модулей.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
    static void computeSimulatedAltitude(uint32_t nowMs, size_t profileIndex,
                                         float& outAltitude, float& outPressureAltitude,
                                         int& outVertRate, float& outVs)
    {
        const float altitudeRange = kSimAltitudeMaxMeters - kSimAltitudeMinMeters;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
        if (altitudeRange <= 0.0f || kSimAltitudeHalfPeriodMs == 0UL || kSimAltitudeFullPeriodMs == 0UL)
        {
            outAltitude = kSimAltitudeMinMeters;
            outPressureAltitude = kSimAltitudeMinMeters;
            outVertRate = 0;
            outVs = 0.0f;
            return;
        }

