MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_11/System.cpp
        applyOwnshipIdentity(mode);

        float outLat = baseLat;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
        float outLon = baseLon;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
        float outCourse = 0.0f;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
        float outSpeed = 0.0f;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
        float outAltitude = kSimAltitudeMinMeters;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
        float outPressureAltitude = kSimAltitudeMinMeters;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
        float outVs = 0.0f;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
        int outVertRate = 0;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
        const uint32_t nowMs = millis();

        if (mode == FLYRF_MODE_TXRX_TEST2)
        {
            advanceMotionStep(nowMs, g_lastTestFlightStepMs, g_testFlightOffsetSteps, g_testFlightDirection);
            computeTrackPosition(baseLat, baseLon, kTestTrackOwnForwardCourseDeg,
                                 g_testFlightOffsetSteps, g_testFlightDirection,
                                 outLat, outLon, outCourse, outSpeed);
        }

        // В тестовых режимах курс нашего самолета всегда равен 0,
        // независимо от направления имитации движения.
        outCourse = 0.0f;

        outAltitude = kTestOwnshipAltitudeMeters;
        outPressureAltitude = kTestOwnshipAltitudeMeters;
        outVs = 0.0f;
        outVertRate = 0;

        ThisAircraft.latitude = outLat;
        ThisAircraft.longitude = outLon;
        ThisAircraft.local_latitude = outLat;
        ThisAircraft.local_longitude = outLon;
        ThisAircraft.old_latitude = outLat;
        ThisAircraft.old_longitude = outLon;
        ThisAircraft.altitude = outAltitude;
        ThisAircraft.pressure_altitude = outPressureAltitude;
        ThisAircraft.vert_rate = outVertRate;
        ThisAircraft.course = outCourse;
        ThisAircraft.speed = outSpeed;
        ThisAircraft.hdop = 0;
        ThisAircraft.geoid_separation = 0.0f;

        serviceSimulatedTraffic(baseLat, baseLon, mode);
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
    static void serviceOwnshipTransmit()
    {
        const uint32_t nowMs = millis();
        if ((uint32_t)(nowMs - g_lastOwnshipTxMs) < 1000UL)
        {
            return;
        }

        g_lastOwnshipTxMs = nowMs;
        refreshOwnshipTimestamp();

        if (settings != nullptr && !FlyRfMode_usesLocalCoordinates(settings->mode))
        {
            applyOwnshipIdentity(settings->mode);
            if (GNSS_coordinatesValid())
            {
                if (ThisAircraft.latitude != 0.0f || ThisAircraft.longitude != 0.0f)
                {
                    ThisAircraft.old_latitude = ThisAircraft.latitude;
                    ThisAircraft.old_longitude = ThisAircraft.longitude;
                }
                RF_TransmitThisAircraft(true);
                return;
            }

            if (ThisAircraft.old_latitude != 0.0f || ThisAircraft.old_longitude != 0.0f)
            {
                ThisAircraft.latitude = ThisAircraft.old_latitude;
                ThisAircraft.longitude = ThisAircraft.old_longitude;
                RF_TransmitThisAircraft(true);
            }
            return;
        }

        if (ownshipHasAnyCoordinates())
        {
            RF_TransmitThisAircraft(true);
        }
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
float SystemDisplayCourseDeg()
{
    return normalizeCourse360(ThisAircraft.course);
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
void SystemSetup()
{
    Serial.println();
    Serial.println(F("Start setup"));
    Serial.print(F("[SETUP] Version: "));
    Serial.println(DeviceInfo_programVersion());

    Log_setup();
    Serial.println(F("[SETUP] Log ready"));

    TrafficDB.init();
    Serial.println(F("[SETUP] Container ready"));

    EEPROM_setup();
    Serial.println(F("[SETUP] EEPROM ready"));

    if (settings != nullptr)
    {
        ThisAircraft.addr = getChipId() & 0x00FFFFFFUL;
        ThisAircraft.squawk = 1111;
        memset(ThisAircraft.callsign, ' ', sizeof(ThisAircraft.callsign));
        memcpy(ThisAircraft.callsign, "FlyRF", 5);
        ThisAircraft.timestamp = 0;
        ThisAircraft.altitude = 0.0f;
        ThisAircraft.pressure_altitude = 0.0f;
        ThisAircraft.speed = 0.0f;
        ThisAircraft.course = 0.0f;
        ThisAircraft.vert_rate = 0;
        ThisAircraft.old_latitude = 0.0f;
        ThisAircraft.old_longitude = 0.0f;
        ThisAircraft.geoid_separation = 0.0f;
        ThisAircraft.hdop = 0;
        ThisAircraft.aircraft_type = settings->aircraft_type;
        applyOwnshipIdentity(settings->mode);
        if (FlyRfMode_usesLocalCoordinates(settings->mode))
        {
            ThisAircraft.latitude = settings->local_latitude;
            ThisAircraft.longitude = settings->local_longitude;
            ThisAircraft.local_latitude = settings->local_latitude;
            ThisAircraft.local_longitude = settings->local_longitude;
            settings->input_coordinates = IMPUT_COORD_MANUAL;
        }
        else
        {
            ThisAircraft.latitude = 0.0f;
            ThisAircraft.longitude = 0.0f;
            ThisAircraft.local_latitude = 0.0f;
            ThisAircraft.local_longitude = 0.0f;
            settings->input_coordinates = IMPUT_COORD_GNSS;
        }
        ThisAircraft.rp2040_gain = settings->threshold_level;
    }
    Serial.printf("[SETUP] Local coordinates: %.5f, %.5f\r\n", settings ? settings->local_latitude : 0.0f, settings ? settings->local_longitude : 0.0f);
    Serial.printf("[SETUP] RP2040 gain: %d\r\n", (int)ThisAircraft.rp2040_gain);

    FlyRfSpiSetup();

